1
Знакомство.

Давайте знакомиться) Создайте программу, которая выведет на консоль информацию о Вас. Постарайтесь использовать все типы данных.
Необходимая
информация: ФИО, возраст, пол, Место работы, место учебы, курс,
направление, изучали ли программирование ранее, желаемая зарплата.

Пример вывода:
Имя: Иван
Фамилия: Иванов
Место учебы: КНУ






2
Создать и распечатать 45 переменных

Создать и распечатать 45 переменных на 5 различных тем (по 9
переменных на каждую тему). Темы: любовь, религия, космос, автомобили,
природа.

Все переменные создать в одном файле.

Перед каждой темой нужно написать однострочный комментарий - тему.

Сдать нужно исходный код, скриншот выполнения.





3
Описание ноутбука

Опишите с помощью переменных свой ноутбук.





4
Работа своей мечты

Опишите работу своей мечты с помощью переменных. Например: страна,
зарплата, есть кондиционер, количество рабочих дней и так далее






