# # Задача 6:
# Выведите первый, последний и средний элемент списка.
countries_of_east = ('Singapore', 'Malaysia', 'Indonesia', 'Hawaii', 'Вьетнам', 'Гонконг',
                    'Индия', 'Индонезия', 'Казахстан', 'Китай', 'Малайзия', 'Монголия')
print(countries_of_east[0], countries_of_east[6], countries_of_east[11])
