# Задача 7:
dict1 = {'c': 8, 'd': 14}
# Написать скрипт который проходится по ключам и проверяет значения
for i  in dict1.values():
    if i / 3:
        print('Hi')

    else:
        print('typa')
for i in dict1.values():

    if i / 5:
        print('bye')
    else:
        print("bakyt lyshii")

# # a) Если значение делиться на 3, то записываем строку “Hi”
# # b) Если значение делиться на 5, то записываем строку “Bye”

# ПРИМЕР:
# Дано ->

# Результат ->
# a = Bye
#
# b = Hi


