# Написать lambda которая принимает 3 параметра и умножает все параметры между собой.
# Функция должна вернуть строку: "Объём бассейна " и значение которое получилось.
l = lambda x,y,z: f"obem basseina{x * y * z} m3"
print(l(4,5,6))

